# Tyler Banks
## Week 13 - 04/25/21
### Python - Pandas DataFrame - Grouping and Mapping

In [2]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [5]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [7]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}

In [8]:
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [9]:
df['state'] = df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [11]:
#apply
def meter(x):
    return x / 3.3808

In [12]:
df['altitude'] = df['altitude'].apply(meter)

In [13]:
df

         city     altitude       state
0        Alma  3062.884524    Colorado
1  Brian Head  2898.722196        Utah
2    Fox Park  2680.430667     Wyoming
3   Lake Mary  2652.035021  California

In [14]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT', 'OH', 'TX', 'OR'])

df

           b         d         e
UT  1.510227  0.486507  0.452639
OH  1.116927  0.305375  0.169483
TX -0.674172 -0.448612 -0.040405
OR -2.646619 -1.118968 -1.824962

In [15]:
def dif(x):
    return x.max() - x.min()

In [16]:
df.apply(dif)

b    4.156847
d    1.605474
e    2.277601
dtype: float64

In [18]:
df.apply(dif,axis=1)

UT    1.057588
OH    0.947445
TX    0.633767
OR    1.527652
dtype: float64

In [21]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-2.646619  1.0  0.0  0.0
-1.824962  0.0  0.0  1.0
-1.118968  0.0  1.0  0.0
-0.674172  1.0  0.0  0.0
-0.448612  0.0  1.0  0.0
-0.040405  0.0  0.0  1.0
 0.169483  0.0  0.0  1.0
 0.305375  0.0  1.0  0.0
 0.452639  0.0  0.0  1.0
 0.486507  0.0  1.0  0.0
 1.116927  1.0  0.0  0.0
 1.510227  1.0  0.0  0.0

In [29]:
#groupby
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

In [30]:
df

  k1   k2  dataset1  dataset2
0  a  one  1.176503  0.705111
1  a  two -0.359514  0.057272
2  b  one  1.129277 -0.171135
3  b  two -1.120269 -0.738771
4  c  one  1.665154  0.118429

In [31]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [32]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [33]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [34]:
df

  k1   k2  dataset1  dataset2
0  a  one  1.176503  0.705111
1  a  two -0.359514  0.057272
2  b  one  1.129277 -0.171135
3  b  two -1.120269 -0.738771
4  c  one  1.665154  0.118429

In [35]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.408494
b    0.004504
c    1.665154
Name: dataset1, dtype: float64

In [36]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.408494  0.381192
b   0.004504 -0.454953
c   1.665154  0.118429

In [37]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  1.176503  0.705111
   two -0.359514  0.057272
b  one  1.129277 -0.171135
   two -1.120269 -0.738771
c  one  1.665154  0.118429

In [38]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  1.176503
   two -0.359514
b  one  1.129277
   two -1.120269
c  one  1.665154